Revit 2026 API

# UIControlledApplicationMainWindowHandle Property

---
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual IntPtr MainWindowHandle { get; }
```
```vb
Public Overridable ReadOnly Property MainWindowHandle As IntPtr
	Get
```
```cpp
public:
virtual property IntPtr MainWindowHandle {
	IntPtr get ();
}
```
```fsharp
abstract MainWindowHandle : IntPtr with get
override MainWindowHandle : IntPtr with get
```

#### Property Value

IntPtr

#### Reference

UIControlledApplication Class

Autodesk.Revit.UI Namespace